Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །ཉིན་ཞག་དེ་སུམ་བཅུ་ལ་ཟླ་བ་གཅིག །ཟླ་བ་བཅུ་གཉིས་ལ་ལོ་གཅིག་ཏུ་བརྩིས་པའི་ལྷ་རྣམས་ཀྱི་ལོ་སྟོང་ནི་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ཚེའི་ཚད་ཡིན་ཏེ། དེ་ལ་མིའི་ལྟར་བགྲང་ན་ལོ་བྱེ་བ་ཕྲག་གསུམ་དང་དྲུག་ཁྲི་ཡོད་དོ།
en: Thirty of these days is a month, and twenty of these months is a year. One thousand divine years in this calculation is the lifespan of the Thirty-Three Gods, which is equal to thirty-six million human years.

source: །རྒྱལ་པོ་ཆེན་པོ་གང་གི་ཚེ་རྒྱལ་པོ་ང་ལས་ནུས་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སོང་སྟེ་འདི་སྐད་ཅེས།
en: “Great King, the one who was Śakra at that time, on that occasion—the time when, having gone to the Thirty-Three Gods, King Māndhātṛ

source: ཀྱེ་མའོ་བདག་ལ་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སྟན་ཕྱེད་བསྟབས་ཀྱང་ཅི་མ་རུང་སྙམ་དུ་སེམས་བསྐྱེད་པ་དེའི་ཚེ་དེའི་དུས་ཀྱི་བརྒྱ་བྱིན་ནི་དགེ་སློང་འོད་སྲུང་ཡིན་ནོ།
en: thought, ‘Oh, I wish Śakra, Lord of the Gods, would offer half of his seat to me’—is the monk Kāśyapa. The one who was Śakra, Lord of the Gods, at that time, on that occasion— the time when King Māndhātṛ

source: །གང་གི་ཚེ་རྒྱལ་པོ་ང་ལས་ནུས་འདི་ལྟ་བུའི་སེམས་བསྐྱེད་དེ། མ་ལ་བདག་གིས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གནས་འདི་ནས་ཕྱུང་ལ། བདག་ཉིད་ལྷ་དང་མི་རྣམས་ཀྱི་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱའོ། །སྙམ་པ་དེའི་ཚེ་དེའི་དུས་ཀྱི་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཡིན་ཏེ།
en: thought, ‘I will now drive away Śakra, Lord of the Gods, from this residence, and I myself will rule the kingdoms of gods and humans’—is the Perfectly Awakened One Kāśyapa.

source: སེམས་ཅན་ཤིན་ཏུ་དབང་ཆེ་བར་གྲགས་པ་ལ་ངན་སེམས་བསྐྱེད་པ་དེས་ན་འབྱོར་པ་དེ་ལས་ཉམས་ནས་འཛམ་བུའི་གླིང་དུ་འོངས་ཏེ་ནད་ཚབས་ཆེན་པོས་ཐེབས་ཤིང་འཆི་བ་ལ་ཐུག་པའི་ཚོར་བ་མི་བཟད་པ་མྱོང་བར་གྱུར་ཏོ།
en: Although the king was known as a being of immense power, he conceived an evil thought. Therefore, his success ended and he alighted on the continent of Jambu, became seriously ill, and experienced unbearable mortal pain.

source: །རྒྱལ་པོ་ཆེན་པོ་ཇི་སྙམ་དུ་སེམས།
en: “What do you think, Great King?

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་རྒྱལ་པོ་ང་ལས་ནུ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ཏེ།
en: That one who was King Māndhātṛ at that time, on that occasion, was indeed me.

source: གང་ཡང་ངས་སེམས་ཅན་དེ་སྙེད་ཅིག་ལ་ཕན་པ་བྱས་ན། དེས་བླ་ན་མེད་པའི་ཡེ་ཤེས་མ་ཐོབ་བོ།
en: Although he benefited such a large number of beings, he did not attain supreme knowledge.

source: །འོན་ཀྱང་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་། རྐྱེན་ཙམ་དང་། ཚོགས་ཙམ་ཡིན་ནོ།
en: But these acts were only a cause, only a condition, only a preparation for supreme and complete awakening.” b. A Former Life of King Māndhātṛ:

source: །རྒྱལ་པོ་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: The Son of the Head of a Guild The king, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “O Honored One, what karma did King Māndhātṛ

source: བཙུན་པ་རྒྱལ་པོ་ང་ལས་ནུས་ལས་ཅི་ཞིག་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་དགུང་བདུན་དུ་ཕོ་བྲང་ནང་དུ་གསེར་གྱི་ཆར་བབ་ལགས།
en: create that matured to cause that golden rain that fell for seven days as soon as he thought about it?”

source: རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་འཇིག་རྟེན་དུ་སྟོན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་། ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: “Great King, once in the past there appeared in the world a teacher named Sarvābhibhū, who was a tathāgata, an arhat, a perfectly awakened one, perfect in knowledge and conduct, a sugata, world knowing, a supreme tamer of people to be tamed, a teacher of gods and humans, a buddha, and a blessed one.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཟིལ་གནོན་ཅེས་བྱ་བ་བྱུང་སྟེ། དེའི་ཚེ་ཚོང་དཔོན་གྱི་བུ་ཁྱིམ་ཕུབ་ནས་རིང་པོ་མ་ལོན་པ་ཞིག་གནས་སོ།
en: “At that time there was a son of the head of a guild, who was newly married.

source: །ཡུལ་དེ་ན་ཆོས་ལུགས་ཀྱིས་བག་མར་བཏང་ནས།
en: By the custom of the region, a dowry was to be given to one’s daughter’s husband as soon as he married her;

source: རིང་པོ་མ་ལོན་པར་བག་རྫོངས་བཏབ་སྟེ། ཁྱིམ་ཐབ་ལ་གཏོང་བའི་བག་མ་གང་ཡིན་པ་དེ་རིན་པོ་ཆེ་སྣ་བཞི་ལས་བྱས་པའི་མེ་ཏོག་གིས་བརྒྱན་ནས་ཁྱིམ་ཐབ་ལ་གཏོང་ལ།
en: the bride, adorned with flowers made of four kinds of jewels, was to be given to her husband;

source: ཁྱིམ་ཐབ་དེས་ཀྱང་དེ་ཁྲིད་ནས་རང་གི་ཁྱིམ་དུ་འགྲོ་བས་ཚོང་དཔོན་གྱི་བུ་དེས་རིན་པོ་ཆེ་སྣ་བཞི་ལས་བྱས་པའི་མེ་ཏོག་ཐོགས་ནས་བཞོན་པ་ལ་ཞོན་ཏེ་རང་གི་ཁྱིམ་དུ་ཆས་སོ། །དེ་ཆས་པ་ལས་རེ་ཞིག་ཅིག་ན་ལམ་ན་ཚུར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གནོན་ལྗོངས་རྒྱུ་ཞིང་བྱོན་ཏོ།
en: and the husband was to bring her to his house. The son of the head of a guild rode in a vehicle and departed for his house, carrying flowers made of four kinds of jewels. Soon after he departed, he met the Perfectly Awakened One Sarvābhibhū walking toward him along the road.

source: །དེས་དེ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་པ། བལྟ་བས་ཆོག་མི་ཤེས་པ་མཐོང་ནས་ཤིན་དུ་དད་པ་སྐྱེས་སོ།
en: When he saw him, who was fully ornamented with the thirty-two marks of a great man, whose figure one would never be tired of looking at, great faith arose in the man.

source: །དེ་ནས་དེ་དད་པས་བརླན་པའི་སེམས་ཀྱིས་བཞོན་པ་ལས་བབས་ནས་རིན་པོ་ཆེ་སྣ་བཞི་ལས་བྱས་པའི་མེ་ཏོག་དེ་རྣམས་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གནོན་ལ་གཏོར་ཏོ།
en: With his mind filled with faith, he then alighted from the vehicle and scattered the flowers made of four kinds of jewels toward the Perfectly Awakened One Sarvābhibhū.

source: །ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གནོན་གྱིས་མེ་ཏོག་དེ་དག་ཇི་ལྟར་ཤིང་རྟའི་འཕང་ལོ་ཙམ་ཤ་སྟག་ཏུ་གྱུར་ནས།
en: The Perfectly Awakened One Sarvābhibhū exercised his magical power so that these flowers became as large as chariot wheels, which followed him when he walked and stopped when he stopped.

source: གཤེགས་ན་ཡང་ཕྱི་བཞིན་འོང་ཞིང་བཞུགས་ན་ཡང་འདུག་པ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབས་པ་དང་། དེ་དད་པ་སྐྱེས་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: With faith arisen, the man spoke some verses:

source: སྦྱིན་པ་ཆེན་པོར་གྱུར་པ་འདི་ཡིས་ནི།
en: “ ‘Through this great donation,

source: །འགྲོ་བའི་ནང་དུ་རང་བྱུང་སངས་རྒྱས་ཤོག །རྒལ་ནས་སྔོན་གྱི་རྒྱལ་བས་མ་བསྒྲལ་བའི།
en: May I become a buddha, a self-existing one, among beings. After achieving victory,

source: །སྐྱེ་བོའི་ཚོགས་རྣམས་བདག་གིས་སྒྲོལ་གྱུར་ཅིག །དྲང་སྲོང་ཆེ་ཀུན་ཟིལ་གནོན་བཅོམ་ལྡན་ལ།
en: May I save those people who were not saved by the victors in the past.’

source: །ང་ཡིས་གསེར་གྱི་མེ་ཏོག་བཟང་གཏོར་ནས།
en: “ ‘Having scattered excellent golden flowers

source: །གོ་འཕང་མཆོག་འདི་འདོད་ནས་དེ་ཡི་ཚེ།
en: For the great ṛṣi, the Blessed One Sarvābhibhū,

source: །ང་ཡིས་སྨོན་ལམ་རྒྱ་ཆེན་བཏབ་པ་ཡི།
en: I made this vast aspiration, Yearning for the supreme state.

source: །བསོད་ནམས་དེ་ཉིད་ཀྱི་ནི་རྣམ་སྨིན་གྱིས།
en: “ ‘Through the maturation of this merit,

source: །ལེགས་མཐོང་ཆེན་པོ་དེ་ཡི་གྲོང་ཁྱེར་ཡང་།
en: The city of that King Mahāsudarśana,

source: །གསེར་ལས་བྱས་པ་དགའ་དགའ་ལྟར་འདུག་པ།
en: Made of gold and pleasing,

source: །ཕོ་བྲང་རྩྭ་ཅན་ཞེས་ནི་བྱ་བར་གྱུར།
en: Was named the capital, Kuśāvatī.’

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་ཚོང་དཔོན་གྱི་བུ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །གང་ཡང་ངས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གནོན་ལ་སེམས་དད་པ་བསྐྱེད་ནས།
en: That one who was the son of the head of a guild at that time, on that occasion, was indeed me.

source: རིན་པོ་ཆེ་སྣ་བཞིའི་མེ་ཏོག་གིས་གཏོར་བའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ངའི་ཕོ་བྲང་གི་ནང་དུ་ཞག་བདུན་དུ་གསེར་གྱི་ཆར་བབ་བོ།
en: Because of the maturation of that karma, namely, my gaining faith in the Perfectly Awakened One Sarvābhibhū and scattering flowers made of four kinds of jewels, a golden rain fell in my palace for seven days.” c. A Former Life of King Māndhātṛ: A Grain Merchant

source: །བཙུན་པ་རྒྱལ་པོ་ང་ལས་ནུས་ལས་ཅི་ཞིག་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས།
en: “O Honored One, what karma did King Māndhātṛ

source: གླིང་བཞི་པ་རྣམས་སུ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བགྱིས་པ་ནས་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་བར་དུ་མཆིས་ལགས། རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་འཇིག་རྟེན་དུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ།
en: create that matured to cause his going to the Thirty-Three Gods, after ruling over the kingdom in the four continents?”

source: འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམ་པར་གཟིགས་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “Great King, once in the past there appeared in the world a teacher named Vipaśyin, who was a perfectly awakened one, perfect in knowledge and conduct, a sugata, world knowing, a supreme tamer of people to be tamed, a teacher of gods and humans, a buddha, and a blessed one.

source: དེ་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་རིམ་གྱིས་རྒྱལ་པོའི་ཕོ་བྲང་གཉེན་ལྡན་དུ་བྱོན་ཏོ།
en: In his travels, in due course he arrived at the royal capital, Bandhumatī.

source: །དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་སྔ་དྲོ་ཤམ་ཐབས་མནབས། ལྷུང་བཟེད་དང་ཆོས་གོས་བསྣམས་ནས་རྒྱལ་པོའི་ཕོ་བྲང་གཉེན་ལྡན་དུ་བསོད་སྙོམས་ལ་ཞུགས་སོ།
en: “Soon after, the Perfectly Awakened One Vipaśyin dressed early in the morning, took his bowl and his robe, and entered Bandhumatī, the royal capital, for alms.

source: །དེ་ན་འབྲུ་འཚོང་བའི་ཚོང་པ་ཞིག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་དེ་བལྟ་བས་ཆོག་མི་ཤེས་པ་མཐོང་ནས་ལྷག་པར་དད་པ་སྐྱེས་ཏེ།
en: There a certain merchant dealing in grains saw the Perfectly Awakened One Vipaśyin, whose figure one would never tire of looking at, and then faith arose in the merchant.

source: དེ་དད་པ་སྐྱེས་ནས་སྲན་མུད་ག་ལ་སྤར་བས་བཅུས་ཏེ་ལྷུང་བཟེད་དུ་བླུགས་པ་དང་། དེ་ལས་སྲན་མུད་ག་འབྲུམ་བུ་བཞི་ཞིག་ལྷུང་བཟེད་དུ་སོང་ངོ་།
en: With faith arisen, he scooped up some mudga beans and poured them into a bowl.

source: །འབྲུམ་བུ་གཅིག་ནི་ལྷུང་བཟེད་ཀྱི་ཁར་ཕོག་ནས་ས་ལ་ལྷུང་ངོ་། །ལྷག་མ་རྣམས་ནི་ལྷུང་བཟེད་ཀྱི་ནང་དུ་མ་སོང་བ་ཉིད་དུ་ས་ལ་བོའོ།
en: Out of these mudga beans, four entered the bowl, one hit the edge of the bowl and fell to the ground, and the rest fell directly on the ground, not reaching the bowl.

source: །དེ་ནས་ཚོང་པ་དེ་དད་པ་སྐྱེས་ནས་སྨོན་ལམ་བཏབ་པ།
en: Then, his faith having further increased, the merchant made an aspiration:

source: །སྐྱེ་བོའི་ཚོགས་རྣམས་བདག་གིས་སྒྲོལ་གྱུར་ཅིག །ཅེས་བཏབ་བོ།། །།འདུལ་བ་གཞི།
en: May I save those people who were not saved by the victors in the past.’

source: བམ་པོ་བཞི་བཅུ་རྩ་གཉིས་པ། རྒྱལ་པོ་ཆེན་པོ་ཇི་སྙམ་དུ་སེམས།
en: “What do you think, Great King?

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་འབྲུ་འཚོང་བའི་ཚོང་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ཏེ།
en: That one who was the merchant dealing in grains at that time, on that occasion, was indeed me.

source: ངས་དེ་ན་གང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ལ་དད་པ་སྐྱེས་ཏེ། སྲན་མུད་ག་ལ་སྤར་བས་བཅུས་ནས་ལྷུང་བཟེད་དུ་བླུགས་པ་དང་། དེ་ལས་སྲན་མུད་ག་འབྲུམ་བུ་བཞི་ཞིག་ལྷུང་བཟེད་དུ་སོང་ངོ་། །ལྷག་མ་རྣམས་ནི་ས་ལ་བོའོ།
en: There, my faith in the Perfectly Awakened One Vipaśyin arisen, I scooped up some mudga beans and poured them into his bowl, four of which entered the bowl and the rest fell on the ground.

source: །ལས་དེའི་རྣམ་པར་སྨིན་པས་གླིང་བཞི་རྣམས་སུ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱས་སོ།
en: Because of the maturation of this karma, I ruled over the kingdom in the four continents.

source: །གང་ཡང་དེ་ན་སྲན་མུད་ག་འབྲུམ་བུ་གཅིག་གིས་ལྷུང་བཟེད་ཀྱི་ཁར་ཕོག་ནས་ས་ལ་ལྷུང་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་བར་དུ་སོན་ཏོ།
en: Because of the maturation of the karma in which one mudga bean hit the edge of the bowl and fell to the ground, I went to the Thirty-Three Gods.

source: །རྒྱལ་པོ་ཆེན་པོ་གལ་ཏེ་སྲན་མུད་ག་ལྷུང་བཟེད་དུ་བླུགས་པ་ས་ལ་མ་ལྷུང་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ལྷ་དང་མི་རྣམས་ཀྱི་བར་ལ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་པར་འགྱུར་རོ།
en: Great King, if the rest of the beans that had been poured had not fallen on the ground, I would have ruled over the kingdom among the gods and humans because of the maturation of that karma.

source: །དེའི་ཚེ་དེའི་དུས་ཀྱི་འབྲུ་འཚོང་བའི་ཚོང་པ་གང་ཡིན་པ་དེ་ནི་ང་ལས་ནུ་དེ་ཉིད་ཡིན་ནོ།
en: That one who was the merchant dealing in grains at that time, on that occasion, was indeed King Māndhātṛ.

source: །དེ་ལྟར་ན་རྒྱལ་པོ་ཆེན་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐུགས་རྗེ་ཆེན་པོ་ཅན་ལ་བྱ་བ་བྱས་པ་ནི་འབྲས་བུ་དང་ཕན་ཡོན་ཤིན་ཏུ་ཆེན་པོར་འགྱུར་རོ།
en: Therefore, Great King, it will generate a great fruit, a great benefit, to perform service for the Buddha, the Blessed One, who possesses great compassion.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན་འདི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་བྱ་བ་བྱའོ་ཞེས་བསླབ་པར་བྱའོ།
en: Great King, you must learn that you should perform service for the Buddha, the Blessed One.” 2.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ངས་བླ་ན་མེད་པར་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་ཕན་པ་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ཞེས་བྱ་བ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མཐའ་བཞིར་རྣམ་པར་རྒྱལ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ། རིན་པོ་ཆེ་སྣ་བདུན་དང་། མི་རྣམས་ཀྱི་འབྱོར་པ་བཞི་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་།
en: Mahāsudarśana “Great King, again, seeking supreme and complete awakening, I benefited beings. Listen to that story. “Great King, once there appeared a wheel-turning king named Mahāsudarśana, who had conquered the border regions in the four directions, was a righteous Dharma king, and had attained the seven treasures and four kinds of human success.

source: །རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་རིན་པོ་ཆེ་སྣ་བདུན་པོ་གང་དག་དང་ལྡན་ཞེ་ན།
en: “What were the seven treasures King Mahāsudarśana possessed?

source: འདི་ལྟ་སྟེ་འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བཙུན་མོ་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བདུན་པ་ནི་བློན་པོ་རིན་པོ་ཆེ་ཡིན་ནོ།
en: They were the precious chakra, elephant, horse, jewel, woman, householder, and minister.

source: །རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་མི་རྣམས་ཀྱི་འབྱོར་པ་བཞི་པོ་གང་དག་དང་ལྡན་ཞེ་ན།
en: “What were the four kinds of human success King Mahāsudarśana possessed?

source: ཚེ་རིང་ཞིང་ཡུན་རིང་དུ་གནས་པ་ཡིན་ཏེ།
en: “He had a long life, living for an exceptionally long time:

source: དེ་གཞོན་ནུའི་རྩེད་མོས་རྩེ་བ་ལ་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ལོན་ནོ།
en: While he was playing princely games, eighty-four thousand years passed.

source: །རྒྱལ་ཚབ་བྱེད་པ་ལ་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ལོན་ནོ།
en: While he was in the position of crown prince, another eighty-four thousand years passed.

source: །རྒྱལ་སྲིད་ཆེན་པོ་བྱེད་པ་ལ་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ལོན་ནོ།
en: While he was ruling over the great kingdom, another eighty-four thousand years passed.

source: །རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱོད་པ་ལ་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ལོན་ནོ།
en: While he was leading the pure life of a royal ṛṣi, another eighty-four thousand years passed.

source: །རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ཚེ་རིང་ཞིང་ཡུན་རིང་དུ་གནས་པ་གང་ཡིན་པ་འདི་ནི་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོའི་འབྱོར་པ་ཞེས་བྱའོ།
en: This is said to be a success of King Mahāsudarśana: namely, his long life, his living for an exceptionally long time.

source: །གཞན་ཡང་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ནི་གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ་ཡིན་ཏེ། མིའི་ཁ་དོག་ལས་ནི་འདས་ལ་ལྷའི་ཁ་དོག་ནི་མ་ཐོབ་པ་སྟེ། རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་གཟུགས་བཟང་བ།
en: “Moreover, King Mahāsudarśana was well proportioned, attractive, and pleasant to behold—he surpassed the human figure, though he did not attain a divine figure.

source: མཛེས་པ། བལྟ་ན་སྡུག་པ་གང་ཡིན་པ་འདི་ནི་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོའི་འབྱོར་པ་ཞེས་བྱའོ།
en: This is said to be a success of King Mahāsudarśana: namely, his being well proportioned, attractive, and pleasant to behold.

source: །གཞན་ཡང་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ནི་གནོད་པ་ཆུང་ཞིང་ནད་མེད་པའི་རང་བཞིན་ཅན་ཡིན་ཏེ་ཕོ་བ་ཧ་ཅང་བསིལ་བ་མ་ཡིན་ཞིང་ཧ་ཅང་དྲོ་བ་མ་ཡིན་པ།
en: “Moreover, King Mahāsudarśana was by nature free from harm and free from disease, and his temperature was in a good state, neither too cold nor too hot, but healthy.

source: དྲོད་སྙོམས་པ་དང་། དུས་ཀུན་དུ་བདེ་བ་དང་། གནོད་པ་མེད་པ་དང་ལྡན་པས་ཟོས་པ་དང་། འཐུངས་པ་དང་། འཆོས་པ་དང་། མྱངས་པ་རྣམས་ལེགས་པར་བདེ་བར་འཇུ་བར་འགྱུར་ཏེ།
en: His stomach did not suffer any harm, and he safely digested all food and drink, whatever he consumed. This is said to be a success of King Mahāsudarśana:

source: རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་གནོད་པ་ཆུང་ཞིང་ནད་མེད་པའི་རང་བཞིན་ཅན་གང་ཡིན་པ་འདི་ནི་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོའི་འབྱོར་པ་ཞེས་བྱའོ།
en: namely, his being naturally free from harm and disease.

source: །གཞན་ཡང་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ནི་གྲོང་མི་དང་ཡུལ་མི་རྣམས་ཀྱི་སྙིང་དུ་སྡུག་ཅིང་ཡིད་དུ་འོང་བ་ཡིན་ཏེ། དཔེར་ན་བུ་རྣམས་ལ་ཕ་བཞིན་ཏེ།
en: “Moreover, King Mahāsudarśana was admired and loved by the citizens and provincial dwellers, just like a father by his sons.

source: རྒྱལ་པོ་ཆེན་པོ་དུས་གཅིག་ཅིག་ན་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་སྐྱེད་མོས་ཚལ་གྱི་གནས་སུ་སོང་བ་ན་ཤིང་རྟ་སྒྱུར་བ་ལ་སྨྲས་པ།
en: Great King, whenever he went to a park, King Mahāsudarśana ordered the charioteer, ‘Charioteer, drive the chariot properly and slowly.

source: ཤིང་རྟ་སྒྱུར་བ་རེ་ཞིག་ཤིང་རྟ་རིམ་གྱིས་དལ་བུ་དལ་བུས་སྒྱུར་ཅིག །ངས་གྲོང་མི་དང་། ཡུལ་མི་རྣམས་ལ་ཡུན་རིང་དུ་བལྟའོ། །གྲོང་མི་དང་ཡུལ་མི་རྣམས་ཀྱིས་ཀྱང་ཤིང་རྟ་སྒྱུར་བ་ལ་སྨྲས་པ།
en: I will take the time to see the citizens and provincial dwellers.’ The citizens and provincial dwellers asked the charioteer, too, ‘Charioteer, drive the chariot properly and slowly.

source: ཤིང་རྟ་སྒྱུར་བ་རེ་ཞིག་ཤིང་རྟ་རིམ་གྱིས་དལ་བུ་དལ་བུས་སྒྱུར་ཅིག་དང་། བདག་ཅག་ཀྱང་ལྷ་ལ་ཡུན་རིང་དུ་བལྟའོ།
en: We will take the time to see His Majesty, too.’ This is said to be a success of King Mahāsudarśana:

source: །རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་གྲོང་མི་དང་ཡུལ་མི་པ་རྣམས་ཀྱི་སྙིང་དུ་སྡུག་ཅིང་ཡིད་དུ་འོང་བ་གང་ཡིན་པ་འདི་ནི་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོའི་འབྱོར་པ་ཞེས་བྱའོ།
en: namely, his being admired and loved by the citizens and provincial dwellers.

source: །དེ་ནས་དུས་གཞན་ཞིག་ན་གྲོང་མི་དང་ཡུལ་མི་རྣམས་གསེར་དང་། དངུལ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། ལ་བ་རིན་པོ་ཆེ་མང་པོ་དག་ཐོགས་ནས་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “One day the citizens and provincial dwellers came to King Mahāsudarśana, bringing much gold and silver and many gems and bejeweled blankets.

source: །ལྷའི་སླད་དུ་བདག་ཅག་གིས་གསེར་དང་། དངུལ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་ལ་བ་རིན་པོ་ཆེ་མང་པོ་འདི་དག་འཚལ་ཏེ་མཆིས་ལགས་ན།
en: Upon their arrival, they said to King Mahāsudarśana, ‘We offer this much gold and silver and this many gems and bejeweled blankets to Your Majesty.

source: ལྷ་ཐུགས་བརྩེ་བའི་སླད་དུ་འདི་དག་བཞེས་སུ་གསོལ།
en: May Your Majesty have compassion and accept them.’

source: སྣ་བོ་དག་ངའི་ཡུལ་ན་འདི་འདྲ་བའི་ནོར་གྱི་རིགས་ཡོད་པས་མི་འདོད་དོ་ཞེས་སྨྲས་ནས་ལེན་དུ་མ་བཏུབ་བོ། །གྲོང་མི་དང་ཡུལ་མི་རྣམས་ཀྱིས་ལན་གཉིས་ལན་གསུམ་དུ་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷའི་སླད་དུ་བདག་ཅག་གིས་གསེར་དང་། དངུལ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། ལ་བ་རིན་པོ་ཆེ་འདི་དག་འཚལ་ཏེ་མཆིས་ལགས་ན། ལྷ་ཐུགས་བརྩེ་བའི་སླད་དུ་འདི་དག་བཞེས་སུ་གསོལ།
en: “ ‘Gentlemen, I do not want them, for I have such wealth in my land,’ said the king, and he did not accept them.

source: རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོས་ཀྱང་ལན་གཉིས་ལན་གསུམ་དུ་གྲོང་མི་དང་ཡུལ་མི་རྣམས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྣ་བོ་དག་ངའི་ཡུལ་ན་འདི་འདྲ་བའི་ནོར་གྱི་རིགས་ཡོད་པས་མི་འདོད་དོ་ཞེས་སྨྲས་ནས་ལེན་དུ་མ་བཏུབ་བོ།
en: “Nonetheless, the citizens and provincial dwellers offered the treasures a second and a third time, but King Mahāsudarśana refused the second and the third time to accept them.

source: །དེ་ནས་གྲོང་མི་དང་ཡུལ་མི་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་གིས་ལྷའི་ཕྱིར་གསེར་དང་། དངུལ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། ལ་བ་རིན་པོ་ཆེ་རབ་ཏུ་མང་པོ་སྟ་གོན་བྱས་ལ།
en: The citizens and provincial dwellers thought, ‘We have prepared much gold and silver and many gems and bejeweled blankets for His Majesty.

source: དེ་བདག་ཅག་གིས་བླངས་ཏེ་སླར་སོ་སོའི་གནས་སུ་འདོང་བ་ནི་བདག་ཅག་གི་ཚུལ་མ་ཡིན་པས།
en: It would not be right for us to return home with them.

source: མ་ལ་བདག་ཅག་གིས་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོའི་མདུན་དུ་གསེར་དང་། དངུལ་གྱི་ཕུང་པོ་ཆེར་སྤུངས་ལ། མཐའ་གཅིག་ཏུ་ནོར་བུ་རིན་པོ་ཆེ་དང་། ལ་བ་རིན་པོ་ཆེ་བཞག་ནས། འདི་དག་ནི་ལྷ་ཁྱོད་ཀྱི་དཀོར་གྱི་རིགས་ལགས་སོ་ཞེས་སྨྲས་ཏེ་མི་ལྟ་བར་འདོང་ངོ་སྙམ་ནས།
en: We will now pile up a mountain of gold and silver in front of King Mahāsudarśana, put the gems and bejeweled blankets to one side, say, “These are your possessions, Your Majesty,” and leave, not looking at them.’

source: དེ་ནས་གྲོང་མི་དང་ཡུལ་མི་རྣམས་ཀྱིས་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོའི་མདུན་དུ་རིན་པོ་ཆེ་དང་། གསེར་ཕུང་པོ་ཆེན་པོར་སྤུངས་ནས། མཐའ་གཅིག་ཏུ་ནོར་བུ་རིན་པོ་ཆེ་དང་། ལ་བ་རིན་པོ་ཆེ་བཞག་སྟེ། འདི་དག་ནི་ལྷ་ཁྱོད་ཀྱི་དཀོར་གྱི་རིགས་ལགས་སོ་ཞེས་སྨྲས་ནས་མི་ལྟ་བར་དོང་ངོ་། །དེ་ནས་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Then the citizens and provincial dwellers did pile up a mountain of gold and silver in front of King Mahāsudarśana, put the gems and bejeweled blankets to one side, said, “These are your possessions, Your Majesty,” and left, not looking at them.’

source: བདག་གི་ནོར་གྱི་རིགས་ནི་ཆོས་བཞིན་གྱིས་རྙེད་པ་ཡིན་གྱིས་ཆོས་མ་ཡིན་པས་ནི་མ་ཡིན་པས་མ་ལ་བདག་གིས་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་བརྩིག་གོ་སྙམ་པ་དང་། མཐའི་རྒྱལ་ཕྲན་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་བརྩིག་པར་སྤྲོའོ་ཞེས་ཐོས་སོ།
en: “King Mahāsudarśana thought, ‘Since such wealth has been obtained lawfully, not unlawfully, I will now build a palace that is in accordance with the law.’ Eighty-four thousand neighboring minor kings heard that King Mahāsudarśana was going to build a palace in accordance with the law.

source: །ཐོས་ནས་ཀྱང་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་རྩིག་པ་ལ་ཐུགས་ཀྱི་ཕྲིན་ལས་བསྐྱུང་དུ་གསོལ།
en: After they had heard this, they went to King Mahāsudarśana, and when they arrived, they said to King Mahāsudarśana, ‘Your Majesty, please do not worry about building a palace that is in accordance with the law.

source: ལྷའི་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་བདག་ཅག་གིས་བརྩིག་པར་བགྱིའོ།
en: We will build Your Majesty’s palace, in accordance with the law.’

source: །སྣ་བོ་དག་ཁོ་བོའི་ཡུལ་ན་འདི་འདྲ་བའི་ནོར་གྱི་རིགས་ཡོད་པས་མི་དགོས་སོ་ཞེས་སྨྲས་ནས་མ་གནང་ངོ་།
en: “ ‘Gentlemen, since I have such wealth in my land, I do not need it,’ said the king, and he did not assent.

source: །དེ་ནས་ཁམས་ཀྱི་རྒྱལ་ཕྲན་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོའི་རྐང་པ་ལ་གཏུགས་ནས་ཁ་ཅིག་གིས་ནི་གོས་ཀྱི་མཐའ་ནས་བཟུང་།
en: Then the eighty-four thousand neighboring minor kings threw themselves at the feet of King Mahāsudarśana.

source: ཁ་ཅིག་གིས་ནི་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་རྩིག་པ་ལ་ཐུགས་ཀྱི་ཕྲིན་ལས་བསྐྱུང་དུ་གསོལ།
en: Some caught the hem of his garment and some made the gesture of supplication to King Mahāsudarśana, and they implored him, ‘Your Majesty, please do not worry about building a palace that is in accordance with the law.

source: །རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོས་ཁམས་ཀྱི་རྒྱལ་ཕྲན་བརྒྱད་ཁྲི་བཞི་སྟོང་ལ་ཅང་མི་སྨྲ་བས་གནང་ངོ་།
en: “King Mahāsudarśana then assented to the eighty-four thousand neighboring minor kings by remaining silent.

source: །དེ་ནས་ཁམས་ཀྱི་རྒྱལ་ཕྲན་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ཅང་མི་སྨྲ་བས་གནང་བར་རིག་ནས་རང་རང་གི་གནས་སུ་དོང་སྟེ་གསེར་དང་། དངུལ་མང་པོ་དང་། རིན་པོ་ཆེའི་ཀ་བ་རེ་རེ་ཁྱེར་ནས།
en: “Thereupon each of the eighty-four thousand neighboring minor kings, knowing that King Mahāsudarśana had assented by remaining silent, departed for his own residence. They then went back to King Mahāsudarśana, carrying much gold and silver and pillars made of jewels.

source: རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷའི་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་བདག་ཅག་གིས་གང་དུ་ཇི་ཙམ་ཞིག་བརྩིག་ལགས།
en: Upon their arrival, they asked King Mahāsudarśana, ‘Where should we build Your Majesty’s palace, in accordance with the law, and what size should it be?’
